---
kind: type
id: T:Autodesk.Revit.DB.RenderingQuality
source: html/a120752c-e431-93a0-c359-5db2acf3378b.htm
---
# Autodesk.Revit.DB.RenderingQuality

Indicates the rendering quality in rendering settings.

## Syntax (C#)
```csharp
public enum RenderingQuality
```